# -*- coding: utf-8 -*-

# Вывести на консоль жителей комнат (модули room_1 и room_2)
# Формат: В комнате room_1 живут: ...

########################################################################################################################
# Импорт неабсолютный и неотносительный ################################################################################
########################################################################################################################

# Импорт всего модуля
# import room_1
# import room_2

# Импорт всего модуля с другим именем
# import room_1 as r1
# import room_2 as r2

# Импорт конкретного элемента с другим именем
# from room_1 import folks as f1
# from room_2 import folks as f2


########################################################################################################################
# Абсолютный импорт ####################################################################################################
########################################################################################################################

# Импорт всего модуля #1
# import lesson_005.room_1
# import lesson_005.room_2

# Импорт всего модуля #2
# from lesson_005 import room_1
# from lesson_005 import room_2

# Импорт конкретного элемента  с другим именем
from lesson_005.room_1 import folks as f1
from lesson_005.room_2 import folks as f2

print('В комнате room_1 живут:', *f1, 'В комнате room_2 живет:', *f2, sep='\n')

